{
    "basic_info": {
      "description_header": "Hey I'm Nic,",
      "description": "I am currently a front-end engineer at Amazon in the retail org working on the shopping design team. My main priotrites include helping our designers + engineers have an easier work experience. I help build products that assist them - whether it be by creating documetnation sites that thousands of employees see every day, or dedicated tools specific to a team. Prior to my front-end role, I was a design technologist for several years. This role was had me at the intersection of Sr UX designers and engineers. I created several multi-phased, high-fidelity web protoypes to help our teams gain confidence from leadership and our end users. Many of these protoypes ultimatley helped drive what is seen on the Seller Central site today!",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "AUI Documentation Site",
        "startDate": "2020",
        "star": {
          "situation": "Previously, there were independent sites for engineers and designers that both related to the same design system. Because there were two reference points, content was regularly out of sync, with data on the designer’s site normally behind due to the need of an engineer to push code for updates. A new documentation site was proposed to solve many of these problems and required exploration into different solutions.",
          "responsibilities": "I became responsible for much of the site ranging from the initial research to the architectural approach and delegation of work. It started with prototyping using several static site generators such as Gatsby and other internal tools. I was able to eventually gain consensus of the entire deployment lifecycle with prototypes and design reviews with senior leaders. Utilizing Gatsby, provided the opportunity to work with modern front-end frameworks and integrate node build scripts – to consume data from multiple sources. I also was able to connect several services together allowing our internal CMS to be the source of truth - giving designers the ability to contribute to the site on their own. Using S3 as the storage for our CMS, an event listener was added to cause our CodePipeline to redeploy our site every time a user made an update to content.",
          "results": "The new site was able to take over the responsibility of providing documentation for the two older sites and created a single source of truth. It allowed not only code but also new content from additional data sources to trigger automatic deployments to the website, which provided a way for both engineers and non-technical employees to contribute back into the site. During the initial month of launch the site, had over 10,000 unique visitors and ~600,000 requests made to it. Though the initial task was to have a site where AUI and Rio design guidelines were combined, since its launch, nine additional Shopping Design teams (and growing) have onboarded as sub-sites."
        },
        "more": "here is more",
        "images": [
          "images/portfolio/aui-docsite/aui-after.png",
          "images/portfolio/aui-docsite/aui-before.png"
        ],
        "caption": [
          "After completing site",
          "Original site"
        ],
        "url": "https://www.dropbox.com/sh/ekpq7jxout444p1/AACq2Fd_qmoUREmWPOmEurtja?dl=0",
        "technologies": [
          {
            "class": "devicon-react-plain",
            "name": "React"
          },
          {
            "class": "devicon-typescript-plain",
            "name": "TypeScript"
          },
          {
            "class": "devicon-gatsby-plain",
            "name": "Gatsby"
          },
          {
            "class": "devicon-amazonwebservices-plain",
            "name": "CodePipeline"
          }
        ]
      },
      {
        "title": "Seller Central Homepage",
        "startDate": "2019",
        "star": {
          "situation": "Partnered with a Sr UX Designer who created the initial updated designs of the Homepage (Gateway) makeover on Seller Central. This design change was to give Selling Partners a more intuitive and cohesive homepage, where they could act on clear, relevant, and personalized recommendations. At the time the homepage suffered a lack of relevance as well as prioritization. This project allowed the Consumer Experience Design team to learn the best approach for delighting our customer with the new Homepage – on behalf of the owning team. However, there had to be a parallel achievement with continuing to earn trust from our customers as any user experience change could have negative impact - especially when the homepage had not been changed in years.",
          "responsibilities": "My responsibilities included creating the initial cards based off the provided Sketch files to create a pixel perfect replication of what we were looking to have our user groups interact with. A base set of card components were created generically (order card, message card, product card, etc..). This provided to be valuable as we tested many different string, image, and designs throughout the experimentation. I also co-ran multiple user studies in several countries collecting feedback about the designs and updated experience. This prototype also provided the chance to do a quality check on our partner teams component library to assess if it had all the appropriate components to build the cards to spec.",
          "results": "The research and rapid development were leading factors of the card design, influencing the away team’s direction for how the experience should look and feel. Because of the overall positivity we received from the feedback during user tests, I was able to provide high fidelity references to the front-end dev who, moved the project into A/B testing and later implement the production code. Several months it later, the card design began to be the default layout for users on the homepage. Improvements in engagement rates, such as clicks per Selling Partner were up +21.7% vs. the control and recommendation acceptances per Selling Partner went up +246.5% vs. control."
        },
        "images": [
          "images/portfolio/homepage/homepage-after-v2.jpg",
          "images/portfolio/homepage/homepage-after-v1.jpg",
          "images/portfolio/homepage/homepage-before-updates.jpg",
          "images/portfolio/homepage/homepage-after-updates.jpg"
        ],
        "caption": [
          "Only cards on homepage protoype",
          "Hybrid version with cards and widgets",
          "Original production homepage",
          "Production homepage after updates"
        ],
        "url": "https://www.dropbox.com/sh/jvcqlvhkws87dbc/AABV-Fk2K0NyzBln8sMGcSWqa?dl=0",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-amazonwebservices-plain",
            "name": "CloudFront"
          }
        ]
      },
      {
        "title": "Seller Central Nav",
        "startDate": "2019",
        "star": {
          "situation": "Partnered with a Sr UX Designer who created the initial updated designs of the navigation that spanned the entire Seller Central site. This design change was to give Selling Partners a more intuitive and cohesive navigational experience. This project was able to allow the Consumer Experience Design (away) team to learn the best approach for delighting our customer with the new navigation. However, there had to be a parallel achievement with continuing to earn trust from our customers as any user experience change could have negative impact - especially with a core component of the page.",
          "responsibilities": "I was responsible for creating pixel perfect web prototype representations of the Sketch files provided. I took the initial designs and created the multiple variations proposed for user testing. These included a version which used a drill-down approach, a version with a dropdown approach (to reveal submenus), a version with a hover approach (with submenus being fly outs on the righthand side), as well as a version with a searchable nav property – to find submenu items. These prototypes were used in multiple remote user studies, gaining insights on how end users would react to the different layouts.",
          "results": "After several months of prototyping multiple versions of the navigation in user testing, the drill-down nav made its way into live A/B testing for a larger audience to use. During this time, I transitioned to another team and was unable to gather finalized metrics. However, after recently looking back at the Seller Central website in 2022, the navigation now closely resembles the design intent of the hovering fly out nav that was also tested in the prototypes. Therefore, it is safe to assume the prototyping had a successful impact on driving the user experience of the navigation for multiple variations."
        },
        "images": [
          "images/portfolio/nav/nav-with-search.png",
          "images/portfolio/nav/nav-drill-down.jpg",
          "images/portfolio/nav/nav-dropdown.jpg",
          "images/portfolio/nav/nav-hover-fly-out.jpg",
          "images/portfolio/nav/nav-before-updates.jpg",
          "images/portfolio/nav/nav-current.png"
        ],
        "caption": [
          "Nav protoype with search bar",
          "Nav protoype with drill down menu",
          "Nav protoype with dropdowns",
          "Nav protoype with fly out",
          "Original production nav",
          "Production nav after updates"
        ],
        "url": "https://www.dropbox.com/sh/g8sy44sczn0qbj4/AACQjsjfKsaQi8YIzgFKlCxma?dl=0",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-amazonwebservices-plain",
            "name": "CloudFront"
          }
        ]
      },
      {
        "title": "Component Exploration",
        "startDate": "2022",
       "star": {
          "situation": "The retail design tools team wanted to explore creating our own set of Amazon UI components that could be utilized by designers in a Storybook (configurator) and by design technologists in a React code package. This was because the current AUI component logic only allowed for server-side components built through their proprietary templating language. This has caused friction for experimentation and ideation as the ramp up to using the components is steep. There is not a quick way currently to test new themes and designs – which has led to long periods required to get engineering to build and test new ideas.",
          "responsibilities": "I executed the proof-of-concept work, which included creating the core form components in React – to look like our 3-year plan design intent. This required building it to accept theme overrides. I also worked with our partner teams Sr Design Technologist to integrate the work into their component configurator, which would allow for UX designers to visualize permutations or explore all the components and their properties. I worked heavily with a style dictionary to generate design tokens at the core, common, and component level.",
          "results": "I was able to successfully create the components for the future facing design with included motion and error states. I was also able to create the desired form demonstration to show the components being used together in a shipping workflow on a mobile device. However, after several months of building out the components to scale (with proper accessibility, working in most browsers, and getting sign-off from designers) it was decided that the level of effort would require more engineering effort to accomplish creating all 40 or more components in a 1:1 fashion. Therefore, the project was put on hold for the time being."
        },
        "images": [
          "images/portfolio/component/text-input.png",
          "images/portfolio/component/checkbox.png"
        ],
        "caption": [
          "Component Configurator page with active text input",
          "Component Configurator page with active checkbox"
        ],
        "url": "https://www.dropbox.com/sh/rbqowmga76fbles/AABQdkfAaAs-4YMdvzw45oBna?dl=0",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-amazonwebservices-plain",
            "name": "CloudFront"
          }
        ]
      },
      {
        "title": "Image Moderator Tool",
        "startDate": "2021",
        "star": {
          "situation": "The objective was to prioritize and complete the identified 2021 roadmap goals that would otherwise be missed if no-one were to step in on behalf of the Homepage team. Accomplishing these tasks allowed the Homepage team to speed up internal review times and be provided deeper metric readouts. Though this was a preexisting application, all the tools within it needed to be modified in some way to meet the requirements.",
          "responsibilities": "I accomplished the flowing tasks: added additional metric capabilities, enhanced the character count, enhanced type size measurement, enhanced accessibility contrast feature, and created a way to filter out approved or rejected images. After deep diving into the project, I saw an opportunity to refactor and clean up code where it would be beneficial for long term maintainability. As I provided the developer updates for the enhanced feature requests, I also split apart and abstracted the existing tools into their own modular React components. Prior to this work, much of the core logic for the tool was implemented inside a single file, making it difficult to support.",
          "results": "Performing these changes allowed the gateway team to maximize their time spent while moderating images within SIM. The work done was positively received by the owning team. With over 43,956 assets in the queue, the tool, and its updates, were estimated to save approximately 1 minute per asset which resolved to 557 hours of review time off our Core Review queue - or about 14 weeks of work."
        },
        "images": [
          "images/portfolio/image-mod/image-mod-color-tool.png",
          "images/portfolio/image-mod/image-mod-count-tool.png"
        ],
        "caption": [
          "Tool being used with color contrast selector",
          "Tool being used with text count selector"
        ],
        "url": "https://www.dropbox.com/sh/v0057wuy6rw6jqd/AACIGmSathH83MldB2UO2Q1Ta?dl=0",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-chrome-plain",
            "name": "Tampermonkey"
          }
        ]
      },
      {
        "title": "Flo Documentation Site",
        "startDate": "2019",
        "star": {
          "situation": "The Core Experience Design (CXD) team had a previous documentation site built on their behalf from an engineer on an away-team. Created with a simple static HTML template, it was designed as a rapid solution for an immediate need to provide information to designers on the proper usage of the Flo design guidelines. The original site was not built to scale and was tedious to include updates. For example, navigation was hard coded into every page and required each HTML document (approximately 50+) to be touched any time a new page was added in. It also required that the content be written directly into the plain HTML files and had no reusability within the site making updates take much longer than needed.",
          "responsibilities": "After maintaining the original site for several months, and having to make time consuming manual changes, I performed an investigation into refactoring the current site or architecting a new solution. Once a deep dive on the existing code base was finished, it was concluded that due to the current architecture, it would be better to deprecate the site in favor of a more scalable approach. A new site would be built to automate more processes and make enhancements as well as maintenance easier to accomplish. Included in the new site was a multipart form submission page. This addition allowed for users to enter in a predefined set of fields - to create articles for the site. The form field was submitted via an API Gateway call to a Lambda which stored the content in DynamoDB and S3. Content approval was done through a table that allowed pages to be managed by the CXD team. Thus, creating a custom content management system.",
          "results": "The new site was launched successfully by the expected deadline and was able to take over the all responsibilities of providing documentation from the original one. Even though it was a team level goal, the expected audience for the site was any designer or engineer looking for more information on the Flo design system within both the Seller and Vendor Org."
        },
        "images": [
          "images/portfolio/flo-docsite/flo-after.jpg",
          "images/portfolio/flo-docsite/flo-before.png"
        ],
        "caption": [
          "After completing site",
          "Original site"
        ],
        "url": "https://www.dropbox.com/scl/fo/42b8txflct82kmyq7a0b6/h?dl=0&rlkey=dqlc28m7apvmappkjm85cog4r",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-amazonwebservices-plain",
            "name": "CloudFront"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Amazon",
        "title": "Front End Engineer II",
        "years": "01/2020 - Current",
        "mainTech": [
          ""
        ],
        "technologies": [
          "React",
          "TypeScript",
          "Node JS",
          "CodePipelines",
          "AWS CDK"
        ]
      },
      {
        "company": "Amazon",
        "title": "Design Technologist II",
        "years": "07/2019 - 01/2020",
        "mainTech": [
          ""
        ],
        "technologies": [
          "React",
          "S3",
          "CloudFront",
          "API Gateway",
          "AWS Lambda"
        ]
      },
      {
        "company": "Amazon",
        "title": "Design Technologist I",
        "years": "05/2017 - 08/2017 & 05/2018 - 07/2019",
        "mainTech": [
          ""
        ],
        "technologies": [
          "React",
          "S3",
          "CloudFront",
          "React Native",
          "Alexa SDK"
        ]
      },
      {
        "company": "Universal Studios Creative",
        "title": "Graphic Design Intern",
        "years": "01/2016 - 08/2016",
        "mainTech": [
          ""
        ],
        "technologies": [
          "Photoshop",
          "Illustrator",
          "Physical textures"
        ]
      },
      {
        "company": "University of Central Florida",
        "title": "B.A In Digital Media (Web Focus) - W/ Minor In Computer Science",
        "years": "08/2014 - 12/2017",
        "mainTech": [
          ""
        ],
        "technologies": [
          "Comp Sci & Comp Sci 2",
          "Object Oriented Programing in Java",
          "Design Fundamentals 2D & 3D",
          "Digital Video, Imaging, and Interactive Design"
        ]
      }
    ]
  }